The coupler is invalid in group.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
 Syntax
  C#
public static FailureDefinitionId CouplerRequiredRemoveFromGroup { get; }
  Visual Basic
Public Shared ReadOnly Property CouplerRequiredRemoveFromGroup As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CouplerRequiredRemoveFromGroup {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RebarCouplerFailures Class
  Autodesk.Revit.DB Namespace